{
    "https://apnews.com/": [
        "Is your car spying on you? What it means that Tesla shared data in the Las Vegas explosion",
        "Soldier who died by suicide in Las Vegas told ex-girlfriend of pain and exhaustion after Afghanistan",
        "New Orleans attack and Vegas explosion highlight extremist violence by active military and veterans",
        "Prince William expresses sadness at death of his former nanny’s stepson in New Orleans attack",
        "Reminders of Jan. 6 attack fade in the Capitol as Trump retakes power",
        "How Congress will certify Trump’s Electoral College victory on Jan. 6",
        "Why are US flags being flown at half-staff on Inauguration Day?",
        "Trump’s sentencing is set for Jan. 10. Here’s what could happen next",
        "House Speaker Mike Johnson held onto his job, but there are signs of trouble ahead",
        "Congress is notified by the Biden administration of a planned $8 billion weapons sale to Israel",
        "What to know as snow, freezing rain and bitter cold heads through much of the US",
        "Jimmy Carter’s 6-day funeral begins with a motorcade through south Georgia",
        "Kidman gives tearful dedication to late mother as film stars gather for heartfelt Palm Springs gala",
        "Have an extra $4 million? You could buy the ‘Breaking Bad’ house",
        "College football turns upside down, but this final four is a collection of the sport’s big programs",
        "How drinking alcohol can affect your health",
        "Heat suspend Jimmy Butler for 7 games and will seek to trade him",
        "Hillary Clinton, George Soros and Denzel Washington will receive the highest US civilian honor",
        "A major airline is being fined for chronic flight delays, and passengers may get a cut of the money",
        "Hundreds of animals killed in Dallas shopping center fire",
        "What it was like having Sunday school class with Jimmy Carter",
        "Venezuela opposition leader recognized by US as election victor embarks on Latin America tour",
        "Asians who relocated to Asia to pursue acting and singing are seeing global crossover opportunity",
        "Why Apple TV+ is offering a free weekend of binge-watching",
        "Sick season is in full force. What the latest CDC figures show",
        "2007: Nancy Pelosi becomes first female speaker of the House",
        "Jimmy Carter funeral: LIVE state service in Georgia",
        "Drone video shows deadly New Year fireworks blast in Honolulu",
        "Plane crashes into California building killing two, injuring 18",
        "Endangered pygmy hippo calf experiences water for first time at Virginia zoo",
        "IN CASE YOU MISSED IT",
        "Jill Biden gets the priciest gift from a foreign leader in 2023 — a $20,000 diamond",
        "Japanese woman who was the world’s oldest person at 116 has died",
        "The dill of a lifetime? In a nation that’s enduring its own sour patch, the pickle dominated 2024",
        "An orca that carried her dead calf for weeks in 2018 is doing so once again",
        "It’s called the ‘Winter Arc.’ And for some, it’s replacing New Year’s resolutions",
        "South Korean adoptees and families rocked by fraud allegations",
        "Psychedelic therapy begins in Colorado, causing tension between conservatives and veterans",
        "Trans trailblazer Sarah McBride navigates a brutal reception in Congress with grace",
        "A butterfly collector in Africa with more than 4.2 million seeks to share them for the future",
        "Making any New Year’s resolutions? Here are some tips to help make them stick",
        "In Gaza’s crowded tent camps, women wrestle with a life stripped of privacy",
        "What to expect at the 2025 Golden Globe Awards",
        "The snubs and surprises in the 2025 Golden Globe nominations",
        "Cynthia Erivo, Demi Moore, Colman Domingo, Jeremy Strong and more react to Golden Globe nominations",
        "List of Golden Globe nominees",
        "‘Emilia Pérez’ leads Golden Globe nominations with 10, followed by ‘The Brutalist’ and ‘Conclave’",
        "Golden Globes host Nikki Glaser: ‘I know where the line is’",
        "Get to know the nominees",
        "Movie Review: A musical, pulpy crime thriller, ‘Emilia Pérez’ swings for the fences",
        "Movie Review: Strippers, oligarchs and a fairy tale gone sideways, ‘Anora’ is a wild ride",
        "Movie Review: ‘Wicked’ fans, rejoicify! Erivo, Grande shine in lavish adaptation of Broadway classic",
        "Movie Review: It’s all politics at the Vatican in ‘Conclave’",
        "Movie Review: Like architecture itself, ‘The Brutalist’ is an epic exercise in ambition and grandeur",
        "Movie Review: ‘The Substance’ is brilliantly disgusting and deranged",
        "Movie Review: A mercurial Kieran Culkin shines in Jesse Eisenberg’s deft, accomplished ‘A Real Pain’",
        "Movie Review: Bob Dylan biopic ‘A Complete Unknown’ is electric in more ways than one",
        "Movie Review: Prepare to get hot and bothered with stylish, synthy tennis drama ‘Challengers’",
        "Movie Review: ‘Nickel Boys’ is a knockout, one of the most powerful films of the year",
        "Jimmy Carter and Playboy: How ‘the weirdo factor’ rocked ’76",
        "One Extraordinary Photo: An AP photographer captures a moment of joy for children of war",
        "One Tech Tip: How to protect your communications through encryption",
        "Come home, Ghana told the African diaspora. Now some Black Americans take its citizenship",
        "Movies in 2024: Lessons from a turbulent year at the box office",
        "Carter’s quest for Mideast peace didn’t end with Camp David",
        "He fought to save jungles in Honduras. Now his killing haunts environmental defenders",
        "Working Well: Returning to the office can disrupt life. Here are some tips to navigate the changes",
        "Physical therapy is ‘the best-kept secret in health care’",
        "How to kick back, relax and embrace a less-than-perfect holiday",
        "FDA says decongestant in many cold medicines doesn’t work. So what does?",
        "How to avoid financial stress during the holiday season",
        "Are you catching holiday blues instead of cheer? Here are some ways to find peace",
        "Stay sober and have a jolly holiday season with these expert tips",
        "Is Secret Santa stressing you out? Here’s your holiday gift-exchange survival guide",
        "AP PHOTOS: Syria’s new security forces conduct sweeps in Homs, looking for ousted Assad’s loyalists",
        "The month of December in pictures",
        "New Orleans attacker had suspected bomb materials at home, reserved truck weeks ago, officials say",
        "An Army veteran’s path to radicalization followed divorces and struggling businesses in Texas",
        "The victims of the deadly New Orleans truck attack",
        "Jimmy Carter’s state funeral starts today. Here is what to know",
        "Viola Davis and Ted Danson celebrated for career achievements in film and TV at Golden Globes event",
        "Officials warned of an escalating threat of international terrorism. Then, the New Orleans attack came",
        "Woman charged with murder in postal worker’s death in a New York deli",
        "New LA district attorney meets with Menendez brothers’ family as he continues to review the case",
        "New Israeli airstrikes in southern Gaza kill at least 15, hospital workers say",
        "The fragile Israel-Hezbollah truce is holding so far, despite violations",
        "Blinken heads to Asia, Europe on last expected trip as top US diplomat",
        "German leader is more worried about Musk’s backing of a far-right party than his insults",
        "Russia-appointed officials in Crimea declare emergency as oil spill reaches Sevastopol",
        "Blast in southwestern Pakistan kills 1 person and wounds 35",
        "Malaysia turns away 2 boats with nearly 300 Rohingya refugees after dozens landed on island",
        "Danish police investigate sighting of numerous drones over the port of Koege",
        "A fire at a food market in northern China kills at least 8 and injures 15",
        "Here’s Kelce! Retired Eagles great Jason Kelce tries his hand as a late-night television show host",
        "David Fincher gives ‘Seven’ a final, 4K UHD glow up for its 30th anniversary",
        "Verizon to bring Super Bowl FanFest to life in 30 cities, offering NFL championship hype nationwide",
        "Man accused of hiding stolen ‘Wizard of Oz’ ruby slippers plans to plead guilty, attorney says",
        "WWE ready to begin Netflix era with ‘Monday Night Raw’ moving to the streaming platform",
        "MLB panel cuts Nationals TV rights fees by 20% for 2024-26",
        "British author David Lodge, twice nominated for Booker Prize, dies at 89",
        "Jets interview Ron Rivera for head coaching job and ESPN analyst Louis Riddick for GM vacancy",
        "Finalized tax credit for cleaner hydrogen gets a cautious OK from some environmental groups",
        "A double dose of nasty winter is about to smack much of the US with snow, ice and biting cold",
        "Drought, fires and deforestation battered Amazon rainforest in 2024",
        "From destruction to deadly heat, Associated Press photographers capture climate change in 2024",
        "Climate change added 41 days of dangerous heat around world in 2024",
        "LeBron James breaks Michael Jordan’s record for 30-point games with his 563rd",
        "PGA Tour moves toward changes to FedEx Cup finale. Finding a solution everyone likes won’t be easy",
        "Dolphins’ Tagovailoa ‘unlikely’ to play Sunday against Jets, Huntley in line for 2nd straight start",
        "Jets interview former Titans coach Mike Vrabel for their head coaching job",
        "US new vehicle sales rose 2.7% last year as prices and interest rates dropped a little",
        "Biden blocks nearly $15 billion acquisition of US Steel by Japan’s Nippon Steel",
        "Rise of US Steel paralleled the arrival of the United States on the world stage",
        "Stock market today: S&P 500 rallies to its first gain since Christmas",
        "California begins 2025 with solid start to winter snowpack, but more storms are needed",
        "Here’s your 2025 guide to the night sky and other celestial wow moments",
        "Giant sloths and mastodons lived with humans for millennia in the Americas, new discoveries suggest",
        "5 things we know and still don’t know about COVID, 5 years after it appeared",
        "Living fences. Leaves with holes. A lived-in vibe. And other likely garden trends for 2025",
        "What’s on the table in 2025? Some predicted trends in food",
        "Meet the Danish-Swedish farmdog, the newest breed in the American Kennel Club’s lineup",
        "This lantern workshop in China is making snakes look cute for the Lunar New Year",
        "Police took over a week to name the NYC subway burning victim. A fake name spread in the meantime",
        "What to know about Apple’s $95 million settlement of the snooping Siri case",
        "Apple to pay $95 million to settle lawsuit accusing Siri of eavesdropping",
        "Turo-rented cars were involved in 2 deadly incidents this New Year’s. Here’s what we know",
        "US Chamber, oil industry sue Vermont over law requiring companies to pay for climate change damage",
        "Surgeon General calls for new label on drinks to warn Americans of alcohol’s cancer risk",
        "Ohio governor vetoes medical free speech clause he says would gut state’s regulatory power",
        "Jimmy Carter made eradicating Guinea worm disease a top mission",
        "Israeli strikes kill at least 42 in Gaza as ceasefire talks set to resume in Qatar",
        "Middle East latest: Germany and France seek a ‘new beginning’ with Syria",
        "Bangladesh court again rejects bail for Hindu leader who led rallies",
        "Elders in Pakistan broker a peace deal between Sunni and Shiite tribes after deadly clashes",
        "Musk helped kill a congressional spending bill. But much of what he spread was misinformation",
        "FACT FOCUS: Inspector general’s Jan. 6 report misrepresented as proof of FBI setup",
        "Luke Littler sets sights on beating Phil Taylor’s record haul of 16 world darts titles",
        "Today in Sports - Miami Dolphins HC Don Shula announces his retirement, winningest NFL HC all-time",
        "Isak scores again to lead Newcastle to win at Tottenham as Tuchel watches on",
        "Spanish league again denies Barcelona’s request to register Olmo",
        "Thomas Tuchel begins scouting work for England and will be pleased with what he saw",
        "Brandon Austin, former US youth goalkeeper, makes Premier League debut and has a tough start",
        "Olympic champ Sara Hector wins World Cup giant slalom as former leader Federica Brignone falls",
        "Rickelton smashes double ton as South Africa cruises to 429-5 in 2nd test against Pakistan",
        "Buffalo visits Luers and Miami (OH)",
        "Collier, William & Mary Tribe take on the Stony Brook Seawolves",
        "Diggins leads UMass against Richmond",
        "South Alabama visits Georgia Southern after Douglas’ 30-point outing",
        "USC Trojans face the Michigan Wolverines on 4-game win streak",
        "Thomas and San Francisco host Washington State",
        "Lafayette, Louisiana Ragin’ Cajuns take on the Georgia State Panthers",
        "Green Bay visits Northern Kentucky following Robinson’s 26-point performance",
        "Telfort and Butler host St. John’s",
        "Glasper and N.C. A&T host Drexel",
        "Furman plays UNC Greensboro after Anderson’s 20-point game",
        "Council and Saint Bonaventure host Fordham",
        "Tulsa plays UAB for conference matchup",
        "Tennessee Tech hosts White and Morehead State",
        "Western Carolina and Samford meet for conference matchup",
        "West Virginia hosts Oklahoma State in conference matchup",
        "Towson visits Boyd and Charleston (SC)",
        "Weber State travels to Northern Arizona for conference matchup",
        "Toolson and Utah Valley host Abilene Christian",
        "Kansas State visits TCU after Hawkins’ 20-point showing",
        "Love leads Arizona against No. 16 Cincinnati after 33-point performance",
        "Brookshire and Austin Peay host Jacksonville"
    ],
    "https://nypost.com/": [
        "Join the new NYP x Half Time Beer Club SUBSCRIBE NOW",
        "USA never goes out of style. Stay warm with our flag merch. SHOP NOW",
        "Make Holidays Great Again. Limited Edition plaque starting at $99. BUY NOW",
        "NYPD applicants plummet as force tries to hire 1,600 officers — with one cop revealing their ‘biggest problem’",
        "Former President Jimmy Carter’s funeral procession begins in Georgia",
        "Aubrey Plaza’s husband Jeff Baena dead at 47",
        "Missing Long Island teen, 14, found on boat nearly month after mysteriously disappearing from home",
        "'Corporate greed'Uber, Lyft spent millions pushing for NYC congestion pricing —and stand to make killing",
        "Trump rages at NYC judges and E. Jean Carroll in Truth Social post",
        "Viral video seemingly shows couple getting freaky on NYC subway: ‘Allah’s so disappointed!’",
        "America needs to wake up to the terror at its doorsteps",
        "Why barbershops may hold the key to African-American health",
        "Gov. Hochul must play hardball with lawmakers to protect NYers from madmen",
        "Questions remainManhattan DA won’t investigate 1965 death of famed journalist who probed JFK assassination — but Hollywood set to suggest foul play",
        "Biden to present Hillary Clinton, George Soros and 17 others the Presidential Medal of Freedom",
        "Vandal filmed spray-painting ‘Kill the Homeless’ on NYC subway — a week after woman was torched",
        "Ex-Jets head coach getting chance to earn reunion with interview set",
        "Danger undergroundKnife-wielding maniac on the loose in NYC after two subway stabbings: NYPD",
        "NYPD limits subway overtime hours — despite surging violence — in wake of Jeffrey Maddrey scandal: sources",
        "Alleged would-be Trump ‘assassin’ Ryan Routh offers to become Hamas hostage in bizzare letter",
        "Gmail, Outlook and Apple users urged to watch out for this new email scam: Cybersecurity experts sound alarm",
        "'A wonderful son'UK tourist killed in New Orleans terror attack ID’d as stepson of Prince William, Harry’s nanny",
        "Gaza War may have pushed New Orleans terrorist toward radicalization, expert",
        "Israeli soldiers who survived battles with Hamas severely injured in New Orleans ISIS-inspired attack",
        "University of Alabama student killed in New Orleans terror attack laid to rest in somber service attended by frat brothers",
        "‘Gentle-hearted’ NJ lacrosse star among 14 victims killed in New Orleans terror attack",
        "Bill Cosby facing second NYC foreclosure after defaulting on $17.5M loan: court papers",
        "Ex-NYPD Chief Jeffrey Maddrey’s former driver — who made $163K in overtime last year — questioned by feds in sex-for-OT probe: sources",
        "JD Vance underwent ‘long-planned’ surgery after attending Senate swearing-in",
        "Elder hits harder!Retiree, 71, heading to church service fights back when group of teen girls attack, try to rob her in NYC subway station: ‘Not today’",
        "As Golden Globes weekend begins, war rages behind the scenes of the glitzy Hollywood awards show",
        "Forget crime, NYC remains the world’s greatest tourist town",
        "Not their best yearHere are the celebs who lost the most followers in 2024 — and the controversies that may have played a part",
        "Obnoxious new tipping trend at luxury hotels leaves guests fuming: ‘Free money from stupid people’",
        "LinkedIn banned ‘proud Jew’ Manhattan CPA for pro-Israel posts, lawsuit claims",
        "With Mike Johnson set as speaker, Republicans can — must — get on to governing",
        "Off the railsDaniel Penny’s prosecution was ‘BS’ and a ‘political trial,’ NYC’s original subway vigilante says",
        "Gov. Hochul, NY’s biggest climate-change booster, has spent $415K on private jets: ‘It’s very wasteful’",
        "Woman accused of stabbing postal worker over spot in NYC deli line has history of knife violence",
        "Hochul unveils vague plan to tackle NYC mental health crisis — but critics say too little, too late as subway violence plagues city",
        "Why he did itCops reveal Special Forces soldier’s motive for Cybertruck bombing — as he trashed ‘feckless leadership’ of a USA ‘near collapse’",
        "MMA star who competed in reality TV show with Vegas Cybertruck bomber speaks out over explosion",
        "Timothée Chalamet has already won this awards season — and in ‘low drama’ love with Kylie Jenner",
        "Trump interrupted golf game to convince GOP holdouts to vote for House Speaker Mike Johnson, lawmaker says",
        "Most New Yorkers quit New Year’s resolutions — or don’t bother to make them at all: survey",
        "Law and disorderIce-T calls cop a ‘f–king a–hole’ during tense exchange caught on bodycam video: ‘This muthaf–ka’",
        "I’m retired Secret Service — take these simple safety precautions when out in public",
        "New year, new juice! Save up to 40% off bestselling juice cleanses from Raw Generation",
        "Draft dramaSome NFL scouts don’t have star college QB graded as ‘anything close’ to first-rounder: insider",
        "Knicks fail biggest test yet as nine-game winning streak ends with brutal loss to elite foe",
        "Magic star exits game in wheelchair in latest blow to team",
        "LSU has found Angel Reese successor but needs others to step up",
        "'Work in progress'Patriots linebacker hammers team’s disgruntled fans: ‘Have to know their place’",
        "Fan favorite back with Yankees three years after stirring Bronx run",
        "Dodgers sign KBO star just hours before posting window expires",
        "Breaking point‘Breaking Bad’ house on sale for $4M as longtime homeowner is sick of gawking fans: ‘We’re done’",
        "Judge denies last-ditch attempt to block congestion pricing from taking effect Sunday",
        "Boy, 15, killed in possible gang-related shooting — hour before another teen was fatally stabbed in bloody NYC night",
        "As Biden & Co. leave, they’re doing their best to trash the country they claimed to serve",
        "Ready to mingleNYC singles dish on why this Sunday is the biggest online dating day of the year",
        "Dear Abby: Am I wrong for telling my SIL and BIL that they should have talked to me before inviting his children to my event?",
        "3-year-old girl mauled to death by ‘vicious’ dogs as her father slept",
        "Sticks and stones…Golden Globes host Nikki Glaser reveals joke Pete Davidson made about this part of her body still stings",
        "Lauren Sarner and Johnny Oleksinski:Our 2025 Golden Globes predictions — who will win?",
        "Everything to know about the Golden Globes 2025: nominees, how to watch, more",
        "Chelsea Handler doesn’t regret shading ex Jo Koy’s disastrous Golden Globes monologue",
        "Nikki Glaser reveals whether she’ll make jokes about Blake Lively and Justin Baldoni at the 2025 Golden Globes",
        "Fast-growing fetish can cause serious issues in the bedroom later on, sex experts warn",
        "Ex-NASA astronaut who nearly collided with two ‘metallic orbs’ while piloting plane reveals they had ‘no visible means of propulsion’",
        "Washington state Dems’ tax hike plans leak — along with talking points on how to sell proposals to constituents",
        "Vacation tragedyPregnant teacher dies after falling during a hiking trip in Greece: ‘Missed but never forgotten’",
        "Biden, Jake Sullivan discussed possibility of striking Iran if it tried to develop nuke: report",
        "Why this wife lets her husband sleep with other women",
        "What a father figure!Anti-aging guru Bryan Johnson reveals shocking wellness regimen he shares with teenage son: ‘Future self’",
        "World’s oldest living woman dies at 116 from natural causes",
        "GOP lawmaker, 81, receives medical attention after falling down staircase at US Capitol",
        "Former nurse busted for abuse after 3 premature babies suffer fractures at Virginia hospital",
        "Britney Spears’ ex Sam Asghari on why he still cares for her and his ‘crash course in Hollywood’",
        "Chelsea Handler was reprimanded by Jane Fonda for behaving badly at party",
        "Angelina Jolie shows off new bangs while attending Palm Springs Film Festival Awards with daughter Zahara",
        "Hotel employee arrested in connection to Liam Payne’s death after allegedly supplying singer with drugs",
        "Taylor Swift live updates: Star twins with designer pal in never-before-seen New Year’s Eve throwbacks",
        "'Absolutely perfect'Touching video chronicles man’s journey teaching fiancée to ice skate — so he could propose at Rockefeller Center",
        "King Charles, Prince William won’t attend former President Jimmy Carter’s funeral",
        "Lakers coach bluntly replies to Charles Barkley’s ‘dead man walking’ rant",
        "It’s time for Kathy Hochul to stand up for charter-school kids",
        "Virtual regretCalifornia man apologizes in court for connection to Wisconsin school shooting — without detailing his actions",
        "Inside Taylor Swift and Travis Kelce’s low-key ‘romantic’ New Year’s celebration",
        "Passenger demonstrates the true power of airplane toilet suction in viral video",
        "One for the book!New Yorkers land spots in 2025 Guinness World Records book for hot dog eating, lunges and more",
        "Orca mom seen mourning latest dead calf in same heartbreaking way she did in 2018, new photos reveal",
        "‘Danger tourist’ becomes first ever to visit indigenous tribes in Papua New Guinea",
        "The debt ceiling is a federal budget fire alarm — and Trump should embrace it",
        "Daily Crossword: Take a crack at the puzzle, including those you may have missed",
        "Daily Word Search: Use your noggin to find the hidden words",
        "Daily Mini Crossword: The one you love, but a little smaller",
        "Kidding aroundBen Affleck kicks off 2025 by spending quality time with his son Samuel",
        "Trump will boost US energy with historic Cabinet pick",
        "Ex-‘SNL’ star Rob Schneider pitched LA Times’ billionaire owner to fund ‘conservative version’ of ‘The View’: report",
        "Beloved mascot known for fetching on-field items at sports events has died",
        "New LA DA meets with Menendez brothers’ family as he continues to review the case",
        "Escort doubles down on bold ‘cheating’ claim after going viral: ‘Separating sex and love’",
        "In with the newRing in the new year with Mariah Carey, Hailey Bieber and more",
        "On the rocksAlcohol stocks tumble after US surgeon general calls for cancer warnings",
        "Biden blocks $14.1B sale of US Steel to Japanese buyer, citing national security concerns",
        "TikTok knew livestreams exploited kids — but turned a blind eye and ‘profited significantly’: Utah suit",
        "PayPal accused of racial bias against Asian Americans in funding lawsuit: ‘Wrong kind of minority’",
        "Chanel celebrates the 100th anniversary of its makeup line with chic new book",
        "Dolce & Gabbana, Elle magazine launch luxury condos in Miami",
        "Michael Kors and Jimmy Choo on Madison, John Mulaney on Broadway, more NYC events",
        "Gap showcases exclusive products and collabs in newly revamped NYC store",
        "New York’s new Belmont Park Village sells luxury labels at irresistible prices",
        "Resolution-ready deals: Kickstart your 2025 with these unbeatable new year sales from Amazon to Nordstrom",
        "From smart homes to smart thrones (reviewed by us!) — Why 2025 will be the year of the bidet",
        "Save up to 60% off during the Nordstrom Half-Yearly Sale: Our top picks",
        "Shoppers say this Bowflex dumbbell set is the ‘sexiest gym gear ever’ — Grab it for $150 off now",
        "The 2025 new book releases we’re most excited about, according to two avid readers",
        "Save up to 75% during the Bath and Body Works Semi-Annual Sale — candles, fragrance dupes, and more",
        "11 Best New Movies on Netflix: January 2025’s Freshest Films to Watch",
        "Kevin Costner’s ‘Horizon’ Is Netflix’s New Year’s Surprise",
        "The 10 Best Stand-Up Comedy Specials Of 2024",
        "Giants rookie class showing signs that they can be part of culture change | Blue Rush",
        "Aaron Rodgers and the Jets are heading for a breakup | Gang’s All Here",
        "Will There Be a JT Miller-Rangers Reunion? | Up in the Blue Seats",
        "Jets interview top HC candidate Mike Vrabel | Gang’s All Here",
        "Pizzeria whose tip jar money was stolen thought of a creative way to make back the cash",
        "NYC mayoral hopeful wants to fight City Hall ‘corruption’ with overhauled ‘Integrity’ agency",
        "Sons who followed in footsteps of firefighter fathers killed on 9/11 set for lieutenant promotions",
        "Rudy Giuliani grilled over pricey possessions — like Yankees memorabilia and grandfather’s watch — in $148M defamation case",
        "Yankees look like they clear this important bar after post-Juan Soto Plan B",
        "NBPA slams Heat’s Jimmy Butler suspension, plans to grieve",
        "The game fantasy football players can find refuge in for NFL Week 18",
        "Look toward contract incentives to help your fantasy football team fight off Week 18 monsters",
        "Accused NYPD sex pest shouldn’t be allowed firearms in retirement — cutting off potential security work, advocates say",
        "Vile attacker pummels, strangles woman, 22, in NYC attempted rape: cops",
        "Judge says Trump won’t face jail, fine in ‘hush money’ case as he schedules sentencing for 10 days before inauguration",
        "LI man busted on animal cruelty charges for 2nd time in weeks after failing to get treatment for dog struck by car: DA",
        "Denise Richards reveals shocking injury she suffered filming ‘Special Forces’ season 3",
        "‘Oogum Boogum’ singer dead at 83: ‘Catch you on the rebound’",
        "Here’s how to watch Knicks, Rangers games if you lost MSG with Optimum",
        "Patti LuPone joins ‘And Just Like That’ Season 3 in a secret role",
        "The end of the ‘Obama era’ has officially arrived",
        "New Orleans terror attack raises questions: Letters to the Editor — Jan. 4, 2025",
        "No, Canada! Despite Trump’s trolling, 51st state would drag the US down",
        "Freefalling media’s grim prospects as reach, influence wane",
        "Ford recalls nearly 400,000 trucks, SUVs and cars",
        "Hedge funds score double-digit returns as ‘Trump Trade’ helps cap strong year",
        "‘Potato cartel’ colluded to artificially hike french fry, hash brown prices: lawsuits",
        "JetBlue hit with $2M penalty from DOT over chronic delays, is forced to offer compensation",
        "Joe Biden to award Ralph Lauren the Presidential Medal of Freedom: Style icon the first fashion designer to be honored",
        "I was dress-coded at Universal Studios Theme Park — for wearing a T-shirt",
        "Walmart’s $78 Hermès Birkin dupe is the fashion world’s hottest new handbag — and luxury lovers are fuming",
        "Anyone can get a Birkin — if they follow these steps, Hermès exec reveals: ‘Eventually’",
        "Master your kitchen game with this 8-piece Japanese knife set",
        "Create stunning visuals and branding in minutes with AI Magicx",
        "Purple Carrot plant-based meal kit review: Vegan made easy",
        "Finally, a 3D printer for the rest of us",
        "Meghan Markle’s ‘at home’ cooking show was filmed inside a luxe $8M mansion that isn’t even her own",
        "Japanese company quietly becomes America’s fifth-largest homebuilder",
        "New York and New Jersey top list again as the most abandoned states in 2024",
        "This coastal California mega-estate has finally sold after 15 years",
        "How New York’s YIVO Institute is keeping Yiddish culture alive",
        "‘Boyfriend applications’ take off as Gen Z dumps dating apps for social media appeals",
        "Pooping is good for your brain: Using the toilet before mental tests improves performance, according to new study",
        "‘Dinosaur highway’ uncovered near London after quarry worker notices ‘unusual bumps’",
        "Meta trades left-wing policy chief for Republican in major overhaul",
        "Disgraced crypto exec Do Kwon pleads not guilty to US fraud charges",
        "Net neutrality rules blocked by appeals court in blow to Biden admin",
        "US mulls new rules to limit or ban Chinese drones due to national security concerns",
        "Award-winning TV reporter nicknamed ‘Top Gun’ dies after cancer battle: ‘An unforgettable guy’",
        "Paramount, Skydance hit back after critics slam pending merger’s potential liberal bias, foreign influence",
        "Riveting NY Post documentary gives inside look at Luigi Mangione manhunt, outrage over US health care",
        "‘Trump is not wrong’: MSNBC analyst admits immigration policy ‘not Biden’s finest moment’",
        "Yankees look like they clear this important bar after post-Juan Soto Plan B",
        "The game fantasy football players can find refuge in for NFL Week 18",
        "Rangers star shows he's still got it with big night in skid-busting win",
        "‘RuPaul’s Drag Race’ Season 17 cast recap Episode 1 in Confession Cube",
        "Aubrey Plaza’s husband, Jeff Baena, dead by suicide at age 47: report",
        "Star snaps of the week: Ring in the new year with Mariah Carey and more",
        "Bikini-clad Jennifer Aniston lounges poolside with pal Jason Bateman on Cabo vacation",
        "Inside Taylor Swift and Travis Kelce’s low-key ‘romantic’ New Year’s celebration",
        "Yankees look like they clear this important bar after post-Juan Soto Plan B",
        "Forget crime, NYC remains the world's greatest tourist town",
        "The game fantasy football players can find refuge in for NFL Week 18",
        "Dear Abby: Am I wrong for telling my SIL and BIL that they should have talked to me before inviting his children to my event?",
        "Resolution-ready deals: Kickstart your 2025 with these unbeatable new year sales from Amazon to Nordstrom",
        "From smart homes to smart thrones (reviewed by us!) — Why 2025 will be the year of the bidet",
        "Save up to 60% off during the Nordstrom Half-Yearly Sale: Our top picks",
        "Shoppers say this Bowflex dumbbell set is the 'sexiest gym gear ever' — Grab it for $150 off now",
        "The 2025 new book releases we're most excited about, according to two avid readers",
        "Meghan McCain Rips Meghan Markle For “Ill-Advised” Netflix Series: “Do Something To Help People Instead Of Your Ego”",
        "Some scouts don't have Shedeur Sanders graded as 'anything close' to NFL first-rounder: insider",
        "Rex Ryan to interview for Jets head coach opening as he hopes for reunion",
        "Deion Sanders sends message to Jets after Louis Riddick GM interview",
        "Andrew Velazquez back with Yankees three years after stirring run with hometown team",
        "Jimmy Butler suspended seven games, Heat now open to trading star in latest twist"
    ],
    "https://news.yahoo.com/": [
        "Winter storm emergency declared ahead of heavy snow, freezing temperatures",
        "FBI releases new images of suspect in 'ISIS-inspired' attack on Bourbon Street",
        "Clues emerge from phone recovered by investigators of Las Vegas Cybertruck blast",
        "Jimmy Carter's long public goodbye begins with motorcade through Georgia",
        "Johnson faces tough road on Trump agenda after dramatic House speaker vote",
        "Reminders of Jan. 6 attack fade in the Capitol as Trump retakes power",
        "Major winter storm to bring heavy snow and ice from Plains to mid-Atlantic as arctic cold temperatures will set in through mid-January",
        "Emirates calls out social media platforms over fake plane crash video",
        "After going on more than 50 cruises, there are 4 things I still hate about this type of vacation",
        "Costco's defense of its DEI initiatives is less surprising than it might seem",
        "\"Fake, made up charge\": Trump calls for judge to be \"disbarred\" after hush money sentencing date set",
        "Aubrey Plaza’s Husband, 47, Found Dead by Assistant at Los Angeles Home",
        "Video shows first responders extricating man from rollover wreck on Los Angeles freeway",
        "We can afford to go to high-end restaurants, but we swear by taking our family to steakhouse chains instead",
        "I lived in New York City and London. The British capital was cheaper and more welcoming, so I could plan my life long-term.",
        "John Roberts is worried about all the wrong things",
        "7 things to know about Bettina Anderson, who is reportedly dating Donald Trump Jr.",
        "Can I outsmart thieves with a hidden AirTag in RFID wallet?",
        "5 renter-friendly ways to make an apartment feel more luxurious, according to interior designers",
        "I worried my son wouldn't talk to me when he started college. I have him send me a 'proof-of-life' selfie every day.",
        "Suspected illegal immigrant's fake bomb threat shuts down SC highway",
        "New Orleans terror attack victim with broken legs says he feels 'lucky': 'I'm alive'",
        "Having a baby in my 40s was hard. But I was able to appreciate little things more.",
        "Family of William and Harry’s Beloved Nanny Among Dead in New Orleans",
        "Wealthy travelers are flocking to luxury trains costing more than $4,000 a night",
        "BI Today: No alcohol, no problem",
        "Congresswoman calls for Fort Liberty whistleblowers to come forward after NOLA, Vegas attacks",
        "Santos refutes serious allegations in landmark legal battle: 'Not a promise or prediction'",
        "Government regulator approves new multibillion-dollar 'electricity superhighway' — here's how it could impact energy",
        "Scientists make concerning discovery while studying autopsied brains: 'We need to start thinking about this as a real public health concern'",
        "Fruit farmers issue serious warnings after pantry-staple foods become nearly impossible to grow — here's how it could impact prices",
        "Ditch boring emoji and create your own unique versions with Genmoji on iPhone",
        "Inside Israel’s daring raid that destroyed Iran-funded underground missile factory in Syria",
        "“There is no morality right now”: Former Rep. Adam Kinzinger on Donald Trump's GOP",
        "Manufacturer transforms recycling facility with cutting-edge system: 'It should be installed on every machine from the beginning'",
        "Seasoned firefighter makes stunning acknowledgement after years of battling blazes across the US: 'This is new for us'",
        "Department hustling to issue final payouts from $400 billion program before Trump's return: 'They want to ... safeguard as much progress as they can'",
        "Startup unveils high-tech pedal-less bike with an eye-popping look: 'Exemplifying a perfect blend of form and function'",
        "Amazon expands key program that could revolutionize the tech industry: 'We need to work together'",
        "Scientists demonstrate breakthrough with new artificial intelligence weather tool: 'It's a big deal'",
        "Scientists unveil next-gen battery tech that could revolutionize EVs: 'This represents a foundational technology'",
        "The government wants to give you $600 for a new AC unit — here's how to cash in",
        "Experts issue warning over concerning decline observed across nearly half of marine species: 'Devastating the natural systems we depend on'",
        "Brazil announces controversial new plan that could drastically change the meat industry: 'People want to know'",
        "“An honest broker”: Wisconsin Democrat \"generates excitement\" in race for DNC chair",
        "Tesla locks in deal to enhance power in France with game-changing technology: 'Every Megapack delivered helps the cause'",
        "The new science on alcohol and cancer: 4 studies that found a link",
        "What we know about Matthew Livelsberger, the suspect behind the Las Vegas Cybertruck explosion",
        "Nvidia's CEO says getting up onstage terrifies him. He's not the only leader to feel that way.",
        "The top 20 safest cities to live in the US, ranked",
        "Devastatingly parched reservoir receives incredible lifeline after rainstorm — here's why it matters",
        "Scientists make major breakthrough on quest to harness futuristic fuel using solar tech: 'It is expected to facilitate advancements'",
        "Report warns of ticking time bomb that may decimate home values and upend the housing market — here's what you should know",
        "Newly revealed documents shed light on disturbing alliance between ExxonMobil and free-market think tanks: 'This should not be an area of focus'",
        "Disturbing new report uncovers bitcoin operation with troubling ties to the Russian state: 'The evidence is clear'",
        "Feeling better about the economy? The \"vibecession\" might be ending"
    ],
    "https://abcnews.go.com/": [
        "This Week with George Stephanopoulos",
        "World News Now & America This Morning",
        "World News Tonight with David Muir",
        "Do Not Sell or Share My Personal Information",
        "Image/Video Solicitation Rights Confirmation Terms",
        "Share Tips with ABC News",
        "Your US State Privacy Rights"
    ],
    "https://www.thedailybeast.com/": [
        "Bruce Springsteen Reviews ‘The Bear’ Star in Upcoming Biopic",
        "Nancy Mace’s Bathroom Ban Missing from House Rules Package",
        "Matt Gaetz Unveils Radical New Look During MAGA TV Debut",
        "Musk’s British Chum Tells Him to Butt Out of U.K. Politics",
        "SCOTUS Justices Won’t Be Investigated Over Ethics Concerns",
        "Trump Border Guru Admits: No Proof for My Terrorism Claims",
        "Meta Swaps Out Liberal Policy Chief for Prominent Republican",
        "Fox Hosts Clash Over NOLA Attack Claim: ‘That’s Not True!’",
        "This New Novelty Candle Is Inspired by the New Jersey Drones",
        "Therabody’s New Depuffing Wand Reduces Swelling in Minutes",
        "The Most Absurd Conservative Controversies of 2024",
        "Black Nazis, Pet Murder & Jewish Space Lasers: 2024 Scandals",
        "Don Jr. Blasts ‘Amateur Night’ NYE Party at Mar-a-Lago"
    ],
    "https://www.npr.org/": [
        "Vehicular attacks are not new. But preventing them has been a big challenge",
        "Net neutrality is struck, ending a long battle to regulate ISPs like public utilities",
        "Biden awards Medal of Freedom to Hillary Clinton, Soros, Messi and 16 others",
        "Trump will be sentenced Jan. 10 in New York case, days before his inauguration",
        "The soldier who died in Cybertruck explosion wrote it was intended as a 'wakeup call'",
        "The U.S. surgeon general wants cancer warnings on alcohol. Here's why",
        "Bats catch a lift from storm winds on long-distance migrations",
        "Funeral services for former President Jimmy Carter start today in Georgia",
        "Seeking to heal the country, Jimmy Carter pardoned men who evaded the Vietnam War draft",
        "A look back at Jimmy Carter's presidency",
        "In Carter's hometown of Plains, people remember the former president",
        "The attack in New Orleans reveals ISIS' influence lingers, experts say",
        "A winter storm with heavy snow is forecast for much of the U.S. this weekend",
        "Mike Johnson is re-elected Speaker of the House, despite initial GOP holdouts",
        "Farmers are abandoning their land. Is that good for nature?",
        "Here's what we know about the victims of the New Orleans truck attack",
        "Brother of driver in New Orleans attack mystified about his radicalization",
        "Photos: Bourbon Street reopens in New Orleans after truck attack",
        "FBI says the suspect in the deadly New Orleans truck attack acted alone",
        "Biden made diversifying the federal bench a top priority. Here's a look at his legacy",
        "Tuberculosis rates plunge when families living in poverty get a monthly cash payout",
        "A guide to your weekend viewing, listening and gaming",
        "Apple TV+ is free this weekend. Here's what we'd watch",
        "5 financial habits to leave behind for a more prosperous new year",
        "NYC's congestion pricing expected to start Sunday after judge rejects challenge from NJ",
        "Japanese woman who was the world's oldest person at 116 has died",
        "Giving up alcohol for Dry January? Our newsletter can help you reach your goal",
        "Cutting out alcohol for Dry January? These apps can help",
        "Tierra Whack: Tiny Desk Concert",
        "Biden blocks U.S. Steel's sale to Japan's Nippon, citing national security concerns",
        "The songs Israelis and Palestinians are listening to now, amid war",
        "Still on the hunt, the FBI shares new details about pipe bombs placed ahead of Jan. 6",
        "Britt Allcroft, who brought Thomas the Tank Engine to television, dies at 81",
        "Apple will pay $95 million to settle a lawsuit accusing Siri of eavesdropping",
        "A record number of migrants reached the Canary Islands by sea in 2024, Spain says",
        "Biden will award the Medal of Honor to Korean and Vietnam War veterans",
        "Amazon's return-to-office order raises questions and fears as it goes into effect"
    ],
    "https://www.financialtimes.com/": [
        "US homebuilder shares slide on fears of higher rates and Trump tariffs",
        "The Weekend Essay.‘That is Maganomics’: where Trump is taking America on trade",
        "Lunch with the FT.Antony Blinken: ‘China has been trying to have it both ways’",
        "opinion content.Why Japan is the perfect place to turn 50",
        "Trump’s ‘hush money’ sentencing set for January 10 but jail time unlikely",
        "Trump ally Mike Johnson re-elected US House Speaker",
        "UK vies with Germany to be European EV champion",
        "Shares of alcohol makers fall after US official calls for cancer warnings",
        "‘There will be a bit of a slump’: London braced for luxury hotel glut",
        "Central bank digital currencies: where we are and what’s next",
        "How the Monetary Policy Radar team scenarios performed in 2024",
        "Bank of Japan will raise rates slowly in 2025",
        "BoJ’s summary of minutes reveals calls for faster pace of tightening",
        "The Big Read.The West End is enjoying a theatre revival. Can Broadway keep up?",
        "opinion content.My new year’s resolution? Only connect",
        "FT Magazine.Inner worlds: a photography special",
        "Rome’s new Romeo hotel is stunning — and not always in a good way",
        "Creating new utopias in Portugal",
        "opinion content.FT Magazine.It’s the weather, stupid: Jancis Robinson on the year in wine",
        "Turner at 250 — why is he so beloved?",
        "opinion content.Our own work in progress",
        "Shares of alcohol makers fall after US official calls for cancer warnings",
        "Antony Blinken: ‘China has been trying to have it both ways’",
        "opinion content.Where the next financial crisis could emerge",
        "Tulip Siddiq was given London flat by developer with links to ousted Bangladeshi government",
        "‘There will be a bit of a slump’: London braced for luxury hotel glut",
        "Biden plans $8bn arms sale to Israel",
        "Germany debates menace of ‘firework bombs’ after New Year’s violence",
        "Top Fed official warns of US inflation risk after Trump takes power",
        "US stocks rally to shake off new year jitters amid light trading",
        "Recovery in US car sales eases fear of   economic malaise settling in",
        "Johannesburg’s shuttered main library becomes symbol of city in decay",
        "Trump attacks UK’s North Sea policy as ‘very big mistake’",
        "Interview.YouTube chief Neal Mohan bets on AI and ‘creators’ to supercharge growth",
        "opinion content.2025 will test the ageing warhorses of the Middle East",
        "opinion content.Lex.Europe readies for scattergun defence-spend bonanza",
        "opinion content.The FT View.Britain’s economic gloom is overdone",
        "opinion content.On Wall Street.Does investment research make sense in the age of AI?",
        "opinion content.The Long View.Where the next financial crisis could emerge",
        "opinion content.Secularists must remember that religion is on the rise",
        "opinion content.This will be the year of investing dangerously",
        "opinion content.Data Points.Inequality hasn’t risen. Here’s why it feels like it has",
        "Biden blocks Nippon Steel’s $15bn takeover of US Steel",
        "US energy markets on edge as ‘polar vortex’ set to deliver deep freeze",
        "Trump uses New Orleans attack to push security and border agenda",
        "Will a weakened Hollywood embrace Trump 2.0?",
        "Meta global affairs chief Clegg to be replaced by Republican Kaplan",
        "Ex-crypto chief Do Kwon brought to New York to face fraud charges",
        "Trump’s ‘Maganomics’ will hurt growth, economists tell FT polls",
        "FT News Briefing.Swamp Notes: Where does Musk fit in Maga?",
        "Unhedged Podcast.The listeners have questions",
        "FT News Briefing.Climate change is coming for your Bordeaux",
        "Behind the Money.Business Book of the Year: Author Parmy Olson on the rise and risks of AI",
        "Review.The contradictions of Xi Jinping",
        "Making the Western great again",
        "Young at heart: menswear’s playful, nostalgic mood sparks joy",
        "FT Magazine.The complex joy of inheriting a British Indian restaurant",
        "Interview.Shigeru Ban: ‘Technology does not make architecture better’",
        "video content.Lars Windhorst and H2O: scandal, spies and the superyacht | FT Film",
        "video content.How safety lapses hit Boeing's reputation | FT Film",
        "video content.Sadiq Khan on hunger in London classrooms | FT",
        "video content.Should the US ban Chinese drones?",
        "French red wine in sharp decline as tastes change among young drinkers",
        "The Big Read.What the ‘year of democracy’ taught us, in 6 charts",
        "FT Alphaville.The coming American labour market shock",
        "The Big Read.How America First will transform the world in 2025",
        "Mexico left with 500mn-litre tequila lake after demand slows",
        "opinion content.Can France become a global AI powerhouse?",
        "Who killed the rave? Late-night dancing falls into global decline",
        "US energy markets on edge as ‘polar vortex’ set to deliver deep freeze",
        "Hedge funds Citadel and Millennium gain 15% in 2024",
        "Ex-crypto chief Do Kwon brought to New York to face fraud charges",
        "The Big Read.Crypto industry dreams of a golden era under Trump",
        "US stocks soar more than 20% for second year in a row",
        "Stockpicking funds suffer record $450bn of outflows",
        "US stocks drop in broad pullback as investors cash in on 2024 gains",
        "Will ‘pet tech’ products appeal as cost of animal ownership soars?",
        "opinion content.On Wall Street.Does investment research make sense in the age of AI?",
        "Online traders warned to check tax return status",
        "Magic monkey tale inspires China’s gaming industry to seek blockbuster success",
        "Meta global affairs chief Clegg to be replaced by Republican Kaplan",
        "opinion content.Business Insight.Musk is standing in the way as Bezos reaches for orbit",
        "opinion content.Undersea sabotage response is a dangerous business"
    ],
    "https://www.newsday.com/": [
        "Congestion pricing in Manhattan starts Sunday. Here's what to know",
        "Still no permanent successor for Oyster Bay's inspector general",
        "No half-staff flags on Nassau buildings in memory of former President Jimmy Carter",
        "Cold Spring Hills nursing home says it won't immediately discharge residents, terminate staff",
        "NYC coffee chain opens third LI location",
        "Habitat for Humanity, inspired by Jimmy Carter's vision, helps LIers become homeowners",
        "LI to see cold temps for weekend, snow possible on Monday",
        "State drought watch canceled, but meteorologists say LI needs more rain",
        "New Orleans attacker had suspected bomb materials at home, reserved truck weeks ago, officials say",
        "Judge upholds Trump's conviction in hush money case, sets sentencing for Jan. 10, signals no jail time",
        "Rabid raccoon caught in Massapequa Park after it bites resident, officials say",
        "LI man pleads guilty in wrong-way crash that killed 2 teen tennis stars",
        "Santos asks judge to delay sentencing, citing lack of money to pay imposed forfeiture",
        "Farmingdale voters to weigh in on $78M school bond proposals",
        "Rock: Why the Giants should keep Daboll and Schoen",
        "Latest news on the presidential transition",
        "Gillen takes oath as LI's newest member of Congress",
        "Stay on your toes, nurture creativity with LI improv classes",
        "U.S. surgeon general calls for update to alcohol warning labels to include cancer risk",
        "Hochul seeks to expand mental health laws to curb subway violence",
        "Budget-friendly rooftop bars in Manhattan offering great views",
        "Online shop opens first LI brick-and-mortar selling vintage-inspired designs",
        "$58 to Tampa and more flight bargains out of LI MacArthur Airport this winter",
        "3 getaways to take this winter that offer spa treatments and outdoor activities",
        "Dinner and a show: Theater productions to pair with a nearby eatery",
        "The best places to eat in Babylon",
        "What to know as Social Security's retirement age increases",
        "Catching up with former News 12 Long Island anchor Stone Grissom",
        "Suffolk DA's cold case unit meets with victim's family 36 years after killing",
        "I DO!: For them, it's been 'easy and comfortable from the first date'",
        "Keep open mind on battery storage",
        "Democrats face five key leadership contests in 2025",
        "Is democracy dying? These states will tell us",
        "Can Putin's reign last through 2025?",
        "Nassau residents can start appealing property taxes",
        "DA: Ronkonkoma man facing new animal cruelty charge after injured puppy found in road",
        "Dispute over NYS ban on Native American mascots, team names continues in these LI school districts",
        "Suffolk County warns not to fly drones near airport",
        "2 former LIers among 14 killed in New Orleans attack",
        "Westwoods is within Shinnecock 'aboriginal territory,' Interior Dept. says",
        "LI parents of neurodiverse children connect through Facebook group",
        "Jimmy Carter's 6-day funeral begins with a motorcade through south Georgia",
        "New Israeli airstrikes in southern Gaza kill at least 15, hospital workers say",
        "House Speaker Mike Johnson held onto his job, but there are signs of trouble ahead",
        "Hillary Clinton, George Soros and Denzel Washington will receive the highest US civilian honor",
        "Japanese woman who was the world's oldest person at 116 has died",
        "Newsday Live Conversations: New York Giants safety and LI native Elijah Riley",
        "Rock: Why the Giants should keep Daboll and Schoen",
        "Rodgers era: Another lost cause for Jets",
        "Giants' Smith-Marsette dynamic on and off the field",
        "Knicks have winning streak ended at nine games as Thunder capture 14th straight",
        "Isles players still back Roy despite a fading season",
        "Best: Barkley sitting vs. Giants the right call",
        "Should Knicks' Josh Hart make All-Star Game?",
        "Mold, roaches and 'life-threatening' hazards: Why these LI public housing facilities failed inspections",
        "At least 46 recently retired LI educators earned over $200,000 in salary and pension",
        "$3.7M and counting: What the fight over Grumman's park cleanup is costing residents",
        "Analysis: 70% of Suffolk school bus camera tickets issued on streets where kids don't cross",
        "Only in NewsdayLI's best new restaurants of the year",
        "LI's best new restaurants of the year",
        "Best things we ate on LI in 20248m read",
        "Best things we ate on LI in 2024",
        "Long Island's best Chinese restaurants of 2024",
        "Long Island's best Chinese restaurants of 2024",
        "Long Island's best pizza of 2024",
        "Long Island's best pizza of 2024",
        "Brown's 22 points, 23 rebounds lead Hills East past Kings Park",
        "Join the discussion on Long Island's stormy future",
        "Long Island's 50 Best Restaurants",
        "Catching up with former News 12 Long Island anchor Stone Grissom",
        "Winter TV preview: 46 great shows to catch",
        "Golden Globes: Our critic picks the winners",
        "'The Six Triple Eight': Tyler Perry's epic WW II drama",
        "Catching up with TV-radio personality Len Berman"
    ]
}